performance_testing/test_results/stress_benchmarking_series/stress_report_18mo_20260519_150505/statistics.json
{
  "03_GET_Dashboard-1" : {
    "transaction" : "03_GET_Dashboard-1",
    "sampleCount" : 4412,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 135.1482320942885,
    "medianResTime" : 27.0,
    "minResTime" : 3.0,
    "maxResTime" : 81475.0,
    "pct1ResTime" : 239.0,
    "pct2ResTime" : 356.34999999999945,
    "pct3ResTime" : 867.0899999999992,
    "throughput" : 27.221629225614986,
    "receivedKBytesPerSec" : 70.30512503316325,
    "sentKBytesPerSec" : 4.731884767733855
  },
  "03_GET_Dashboard" : {
    "transaction" : "03_GET_Dashboard",
    "sampleCount" : 12380,
    "errorCount" : 1,
    "errorPct" : 0.008077544,
    "meanResTime" : 214.411793214863,
    "medianResTime" : 16.0,
    "minResTime" : 3.0,
    "maxResTime" : 91137.0,
    "pct1ResTime" : 343.89999999999964,
    "pct2ResTime" : 559.0,
    "pct3ResTime" : 1681.0900000000056,
    "throughput" : 76.3787348769488,
    "receivedKBytesPerSec" : 99.21945973651496,
    "sentKBytesPerSec" : 18.08187525256498
  },
  "03_GET_Dashboard-0" : {
    "transaction" : "03_GET_Dashboard-0",
    "sampleCount" : 4412,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 334.5294650951949,
    "medianResTime" : 41.0,
    "minResTime" : 3.0,
    "maxResTime" : 91112.0,
    "pct1ResTime" : 489.1000000000008,
    "pct2ResTime" : 1072.0,
    "pct3ResTime" : 1927.0899999999992,
    "throughput" : 27.22078947693143,
    "receivedKBytesPerSec" : 10.254068928073444,
    "sentKBytesPerSec" : 4.758321598018287
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 46024,
    "errorCount" : 1,
    "errorPct" : 0.0021727795,
    "meanResTime" : 201.22431774726218,
    "medianResTime" : 13.0,
    "minResTime" : 3.0,
    "maxResTime" : 95409.0,
    "pct1ResTime" : 424.0,
    "pct2ResTime" : 926.9500000000007,
    "pct3ResTime" : 1856.9700000000048,
    "throughput" : 283.4775645961011,
    "receivedKBytesPerSec" : 376.63232793300176,
    "sentKBytesPerSec" : 56.92880883134182
  },
  "02_POST_Login" : {
    "transaction" : "02_POST_Login",
    "sampleCount" : 12400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 170.57451612903182,
    "medianResTime" : 14.0,
    "minResTime" : 3.0,
    "maxResTime" : 91740.0,
    "pct1ResTime" : 292.0,
    "pct2ResTime" : 477.0,
    "pct3ResTime" : 1366.9799999999996,
    "throughput" : 76.44741465940827,
    "receivedKBytesPerSec" : 96.3947315921253,
    "sentKBytesPerSec" : 19.55978773512204
  },
  "01_GET_Login" : {
    "transaction" : "01_GET_Login",
    "sampleCount" : 12420,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 194.7977455716585,
    "medianResTime" : 15.0,
    "minResTime" : 3.0,
    "maxResTime" : 95409.0,
    "pct1ResTime" : 305.0,
    "pct2ResTime" : 494.9499999999989,
    "pct3ResTime" : 1477.9499999999953,
    "throughput" : 76.4990299036063,
    "receivedKBytesPerSec" : 100.85059673439378,
    "sentKBytesPerSec" : 9.86120307351175
  }
}