performance_testing/test_results/stress_benchmarking_series/stress_report_36mo_20260519_152021/statistics.json
{
  "03_GET_Dashboard-1" : {
    "transaction" : "03_GET_Dashboard-1",
    "sampleCount" : 4420,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 439.3900452488688,
    "medianResTime" : 14.0,
    "minResTime" : 2.0,
    "maxResTime" : 187870.0,
    "pct1ResTime" : 200.0,
    "pct2ResTime" : 306.0,
    "pct3ResTime" : 637.7399999999998,
    "throughput" : 18.732782369146005,
    "receivedKBytesPerSec" : 49.2428670997563,
    "sentKBytesPerSec" : 3.256284435261708
  },
  "03_GET_Dashboard" : {
    "transaction" : "03_GET_Dashboard",
    "sampleCount" : 12698,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 472.81666404158153,
    "medianResTime" : 8.0,
    "minResTime" : 3.0,
    "maxResTime" : 187873.0,
    "pct1ResTime" : 249.0,
    "pct2ResTime" : 392.0,
    "pct3ResTime" : 966.0400000000009,
    "throughput" : 53.21074774971086,
    "receivedKBytesPerSec" : 68.83742967191664,
    "sentKBytesPerSec" : 12.52112101432726
  },
  "03_GET_Dashboard-0" : {
    "transaction" : "03_GET_Dashboard-0",
    "sampleCount" : 4420,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 98.62217194570148,
    "medianResTime" : 24.5,
    "minResTime" : 2.0,
    "maxResTime" : 1875.0,
    "pct1ResTime" : 274.9000000000001,
    "pct2ResTime" : 409.9499999999998,
    "pct3ResTime" : 903.5799999999999,
    "throughput" : 36.78489988182226,
    "receivedKBytesPerSec" : 13.857811823806987,
    "sentKBytesPerSec" : 6.4301729285607285
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 46978,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 288.7563540380606,
    "medianResTime" : 6.0,
    "minResTime" : 2.0,
    "maxResTime" : 187873.0,
    "pct1ResTime" : 190.0,
    "pct2ResTime" : 312.9500000000007,
    "pct3ResTime" : 875.9700000000048,
    "throughput" : 196.78792245438248,
    "receivedKBytesPerSec" : 258.95099112887686,
    "sentKBytesPerSec" : 39.46986602467703
  },
  "02_POST_Login" : {
    "transaction" : "02_POST_Login",
    "sampleCount" : 12714,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 224.09949661790148,
    "medianResTime" : 7.0,
    "minResTime" : 3.0,
    "maxResTime" : 184673.0,
    "pct1ResTime" : 195.0,
    "pct2ResTime" : 286.25,
    "pct3ResTime" : 628.5500000000011,
    "throughput" : 53.274670018856064,
    "receivedKBytesPerSec" : 65.91030028938822,
    "sentKBytesPerSec" : 13.63082377435575
  },
  "01_GET_Login" : {
    "transaction" : "01_GET_Login",
    "sampleCount" : 12726,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 183.4162344805904,
    "medianResTime" : 7.0,
    "minResTime" : 3.0,
    "maxResTime" : 182259.0,
    "pct1ResTime" : 204.0,
    "pct2ResTime" : 296.0,
    "pct3ResTime" : 666.1899999999987,
    "throughput" : 53.30842311623465,
    "receivedKBytesPerSec" : 68.60329472398041,
    "sentKBytesPerSec" : 6.871788917327123
  }
}